---
title:
---
#+TITLE: 2016 SSEC/AOS Workshop Workshop
#+DATE: <2016-06-21 Wed>
#+AUTHOR: Unidata Python Development Team
#+EMAIL: support-python@unidata.ucar.edu
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:comment d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:nil p:nil pri:nil stat:t tags:t tasks:t tex:t timestamp:t toc:t
#+OPTIONS: todo:t |:t
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.2)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+LANGUAGE: en
#+SELECT_TAGS: export

- *When*: 20-21 / 22-23 June 2016
- *Where*: Madison, WI

What follows is a tentative workshop schedule for the Python workshops held in Madison, WI.

** Workshop Schedule for Mon (20th) / Wed (22nd)

|----+----------------------------------------------+-----------------------------+-------------+--------+----------|
|    | Section                                      | IPyNB or Markdown           | Presenter   | Length |     Time |
|----+----------------------------------------------+-----------------------------+-------------+--------+----------|
|  1 | [[https://github.com/Unidata/unidata-python-workshop/blob/master/presentations/git.pdf][Software carpentry for science w/ git]] | presentations/git           | Ryan |   1:00 | 09:00:00 |
|  2 | [[https://github.com/Unidata/unidata-python-workshop/blob/master/presentations/conda_binstar.pdf][Getting Python packages w/ Conda]]             | presentations/conda_binstar | Ryan |   1:00 | 10:00:00 |
|  3 | Break                                        |                             |             |   0:15 | 11:00:00 |
|  4 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/tree/master/notebooks/jupyter-examples][Jupyter notebook introduction]]                | jupyter-examples            | Sean        |   0:45 | 11:15:00 |
|  5 | Lunch on your own                            |                             |             |   1:15 | 12:00:00 |
|  6 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/intro-numpy-and-matplotlib.ipynb][Numpy with intro to matplotlib]]        | intro-numpy-and-matplotlib  | Ryan        |   2:00 | 13:15:00 |
|  7 | Break                                        |                             |             |   0:15 | 15:15:00 |
|  8 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/netCDF-Reading.ipynb][Reading netCDF]]                            | reading_netCDF         | Sean      |   0:45 | 15:30:00 |
|  9 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/netCDF-Writing.ipynb][Writing netCDF]]                            | writing_netCDF         | Sean      |   0:45 | 16:15:00 |
| 10 | End of day 1                                 |                             |             |        | 17:00:00 |
|----+----------------------------------------------+-----------------------------+-------------+--------+----------|
#+TBLFM: @3$6..@-1$6=@-1$5+@-1$6;T::$1=@#-1

** Workshop Schedule for Tue (21st) / Thu (23rd)

|----+-------------------------------------------+------------------------+-----------+--------+----------|
|    | Section                                   | IPyNB or Markdown      | Presenter | Length |     Time |
|----+-------------------------------------------+------------------------+-----------+--------+----------|
|  1 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/pythonic-data-analysis.ipynb][Pythonic Data Analysis]]                    | pythonic-data-analysis | Ryan      |   1:00 | 9:00:00 |
|  2 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/MetPy Units and Upper Air.ipynb][Plotting Upper Air Data with MetPy]]                                         | MetPy             | Ryan      |   0:45 | 10:00:00 |
|  3 | Break                                     |                        |           |   0:15 | 10:45:00 |
|  4 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/Siphon_Cartopy_MetPy_HRRR.ipynb][Accessing Model Data with Siphon/MetPy]]                         | Siphon_Cartopy_MetPy_HRRR           | Sean      |   1:00 | 11:00:00 |
|  5 | Lunch on your own                         |                        |           |   1:15 | 12:00:00 |
|  6 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/GINI Satellite with MetPy and Siphon.ipynb][GINI Satellite Data with MetPy/Siphon]]                 | GINI Satellite with MetPy and Siphon    | Ryan      |   1:00 | 13:15:00 |
|  7 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/Surface Data with Siphon and MetPy.ipynb][Surface Data with Siphon/MetPy]]                     | Surface Data with Siphon and MetPy    | Sean      |   1:15 | 14:15:00 |
|  8 | Break                                     |                        |           |   0:15 | 15:30:00 |
|  9 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/Siphon Radar Server.ipynb][Downloading Radar Data with Siphon]]                         | Siphon Radar Server          | Ryan      |  0:30  | 15:45:00 |
| 10 | Collaborative development on github       |                        | Sean      |   0:45 | 16:15:00 |
| 11 | End of day 2                              |                        |           |        | 17:00:00 |
|----+-------------------------------------------+------------------------+-----------+--------+----------|
#+TBLFM: @3$6..@-1$6=@-1$5+@-1$6;T::$1=@#-1
